[default]
[Application Whitelisting]
cron_schedule = 0 1 * * *
alert.track = 0
alert.digest_mode = True
display.visualizations.singlevalue.useColors = 1
enableSched = 1
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
display.visualizations.singlevalue.colorMode = block
dispatch.earliest_time = -30d@d
schedule_window = 5
search = | pivot Application_Whitelisting Application_Whitelisting dc(host) AS "Distinct Count of host" SPLITROW _time AS _time PERIOD day  ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 0 SHOWOTHER 1 | rename "Distinct Count of host" as dc_host | join [|inputlookup riskscore | where control=1] | eval score=dc_host/60*100 | table _time, score
display.visualizations.type = singlevalue
display.visualizations.singlevalue.rangeValues = [0,30,90,100]
display.visualizations.singlevalue.rangeColors = ["0xd93f3c","0xf58f39","0x6db7c6","0x65a637","0xd93f3c"]
display.general.type = visualizations
dispatch.latest_time = now

[Distinct Count of Trusted Locations]
dispatch.earliest_time = -24h@h
alert.track = 0
enableSched = 1
schedule_window = 5
cron_schedule = 0 0 * * *
display.general.type = statistics
display.visualizations.type = singlevalue
display.statistics.drilldown = none
display.events.list.drilldown = none
search = index=main sourcetype=WinRegistry key_path="*Trusted Locations*Path" \
| rex field=_raw "host\=\"(?<host>[\w\-]+)" \
| rex field=key_path "(?<user>lc\d+)" \
| rex field=key_path "Office\\\(?<office_version>[\d\.]+)" \
| rex field=key_path "\d{1,2}\.\d{1}\\\(?<office_application>[A-Za-z]+)" \
| eval office_version=case(office_version="11.0","Office 2003",office_version="12.0","Office 2007",office_version="14.0","Office 2010",office_version="15.0","Office 2013",office_version="16.0","Office 2016") \
| eval officeName=office_application + " " + office_version\
| stats dc(data) as "Distinct Trusted Locations" by officeName\
| rename data as "Trusted Location" office_application as "Office Application", office_version as "Office Version"
dispatch.latest_time = now

[Distinct Privileged Users over 30 Days]
search = | tstats dc(Authentication.user) AS "Distinct Users" from datamodel=Authentication where (nodename = Authentication.Privileged_Authentication.Successful_Privileged_Authentication) | sort -count
dispatch.earliest_time = -24h@h
alert.track = 0
enableSched = 1
display.visualizations.charting.chart = pie
display.events.fields = ["host","source","sourcetype","profile.groupType","assigned_groups{}","profile.groupScope","settings.app.groupFilter","settings.app.groupName","profile.description"]
display.visualizations.show = 0
schedule_window = 5
cron_schedule = 0 0 * * *
action.email.useNSSubject = 1
request.ui_dispatch_app = essential8-app
request.ui_dispatch_view = search
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics

[Macro Settings in Environment]
dispatch.earliest_time = -24h@h
alert.track = 0
search = index=windows sourcetype=WinRegistry key_path="*VBAWarnings"| rex field=_raw "host\=\"(?<host>[\w\-]+)" \
| rex field=key_path "(?<sid>S\-[\d\-]+)" \
| rex field=key_path "Office\\\(?<office_version>[\d\.]+)" \
| rex field=key_path "\d{1,2}\.\d{1}\\\(?<office_application>[A-Za-z]+)" \
| eval office_version=case(office_version="11.0","Office 2003",office_version="12.0","Office 2007",office_version="14.0","Office 2010",office_version="15.0","Office 2013",office_version="16.0","Office 2016") \
| eval officeName=office_application + " " + office_version\
| eval vba_warning=case(data="0x00000004(4)", "Disable All VBA's without notification", data="0x00000003(3)", "Disable all macros except those digitally signed", data="0x00000002(2)", "Disable All macros with notification",  data="0x00000001(1)", "Enable All Macros")\
| stats dc(sid) as "Distinct Users" by vba_warning\
| rename  vba_warning as "Macro Setting" office_application as "Office Application", office_version as "Office Version"
enableSched = 1
display.statistics.drilldown = none
schedule_window = 15
cron_schedule = 0 3 * * *
display.general.type = statistics
dispatch.latest_time = now

[Macro Trusted Locations By Office Application]
dispatch.earliest_time = -24h@h
alert.track = 0
search = index=windows sourcetype=WinRegistry key_path="*Trusted Locations*Path" \
| rex field=key_path "(?<sid>S\-[\d\-]+)" \
| rex field=key_path "Office\\\(?<office_version>[\d\.]+)" \
| rex field=key_path "\d{1,2}\.\d{1}\\\(?<office_application>[A-Za-z]+)" \
| eval office_version=case(office_version="11.0","Office 2003",office_version="12.0","Office 2007",office_version="14.0","Office 2010",office_version="15.0","Office 2013",office_version="16.0","Office 2016") \
| eval officeName=office_application + " " + office_version\
| stats dc(sid) as "Distinct Users" by office_application, office_version, data \
| rename data as "Trusted Location" office_application as "Office Application", office_version as "Office Version"
enableSched = 1
display.statistics.drilldown = none
schedule_window = 5
cron_schedule = 0 1 * * *
display.general.type = statistics
dispatch.latest_time = now

[Privileged Admin Total Report]
dispatch.earliest_time = -30d@d
alert.track = 0
display.visualizations.singlevalue.useColors = 1
display.visualizations.singlevalue.underLabel = % Compliance with target
display.visualizations.singlevalue.unit = %
schedule_window = 15
display.visualizations.singlevalue.colorMode = block
cron_schedule = 0 1 * * *
search = | pivot Authentication Successful_Privileged_Authentication dc(user) AS "dc_priv" SPLITROW _time AS _time PERIOD day  ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 0 SHOWOTHER 1 | join  [|inputlookup riskscore | where control=5] | eval score=dc_priv/value*100 | table _time,score
display.visualizations.type = singlevalue
enableSched = 1
display.visualizations.singlevalue.rangeValues = [45,50,55,60]
display.general.type = visualizations
dispatch.latest_time = now

